LEXICON_TEXT = {
    "start_text": "👋 Добро пожаловать в цифровую систему «ТИУмничка».\n\n❗️ Для участия в Конкурсе вам необходимо дать согласие на обработку персональных данных (ФИО, группа, контактные данные, данные о внеучебной активности).\n\nПосле ознакомления с текстом выберите один из вариантов: «Даю согласие» или «Не даю согласие».\n\n👇Полный текст согласия — по кнопке ниже.",
    "help_text": "🤖 <b>Инструкция по работе с ботом</b>\n\n"
            "<b>📋 Основные функции:</b>\n"
            "• <b>📝 Подать заявку</b> - отправить заявку на получение ТИУкоинов\n"
            "• <b>💎 Мои ТИУкоины</b> - посмотреть свой баланс и исторю пополнений и списаний\n"
            "• <b>📖 Каталог поощрений</b> - выбрать награду за ТИУкоины\n"
            "• <b>📃 О конкурсе</b> - ознакомиться с положением\n"
            "• <b>❓ Поддержка</b> - получить помощь по вопросам\n\n"
            "<b>⚡ Команды бота:</b>\n"
            "• <code>/start</code> - запустить бота\n"
            "• <code>/help</code> - эта инструкция\n"
            "• <code>/getmytgid</code> - узнать свой Telegram ID\n"
            "• <code>/cancel</code> - отменить текущее действие\n\n"
            "<b>💎 О ТИУкоинах:</b>\n"
            "ТИУкоины начисляются за участие в конкурсах. Их можно обменять на ценные призы в каталоге поощрений.\n\n"
            "<b>📞 Контакты:</b>\n"
            "По всем вопросам обращайтесь в раздел 'Поддержка'",
    "give_agreement" : "✅ Вы приняли Согласие на обработку персональных данных",
    "refuse_agreement" : "❌ Вы не приняли Согласие на обработку персональных данных\n\n😔 Дальнейшая работа чат-бота невозоможна.\n\n <i>Если у вас есть вопросы, можете задать их при помощи команды /help</i>",

    
    "registration_fill_full_name": "❔ Для регистрации в системе «ТИУмничка» введите ваше ФИО\n<i>Например: Иванов Иван Иванович</i>",
    "registration_select_institute": "❔ Выберите ваше структурное подразделение обучения",
    "registration_fill_direction": "❔ Введите ваше направление подготовки\n<i>Например: 09.03.02 Информационные системы и технологии</i>",
    "registration_fill_course": "❔ Введите курс вашего обучения\n<i>Например: 2</i>",
    "registration_fill_group": "❔ Введите группу, в которой вы обучаетесь\n<i>Например: ИИПб-24-2</i>",
    "registration_fill_start_year": "❔ Введите год начала обучения \n<i>Например: 2024</i>",
    "registration_fill_end_year": "❔ Введите год окончания обучения \n<i>Например: 2028</i>",
    "registration_fill_phone_number": "❔ Введите ваш номер телефона\n<i>Например: +79876543210</i>",
    "registration_fill_email": "❔ Введите вашу электронную почту\n<i>Например: ivanovia@std.tyuiu.ru</i>",
    "registration_confirmation": "❔ Проверьте корректность введенных вами данных:",
    "registration_sumbit": "Для завершения регистрации нажмите соответствующую кнопку ниже. 👇",
    "registration_end" : "🙌 Ваша анкета принята и находится на проверке.\n\nПодтверждение первичной анкеты осуществляется в течение 1 <u>рабочего дня</u>.\nПосле подтверждения вам станет доступна подача заявок на начисление «ТИУкоинов».",
    "registration_completed": "😎 Вы успешно зарегистрированы в системе «ТИУмничка»!",
    "re_register_text":"Хорошо, давайте заполним анкету заново. Введите ваше ФИО\n<i>Например: Иванов Иван Иванович</i>",


    "registration_incorrect_full_name": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: Иванов Иван Иванович</i>",
    "registration_incorrect_institute": "😔 Кажется, выбор института не был произведён.\n\nПожалуйста, выберите ваше структурное подразделение обучения из списка.",
    "registration_incorrect_direction": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: 09.03.02 Информационные системы и технологии</i>",
    "registration_incorrect_form_of_education": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: Очная</i>",
    "registration_incorrect_course": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: 2</i>",
    "registration_incorrect_group": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: ИИПб-24-2</i>",
    "registration_incorrect_start_year": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: 2024</i>",
    "registration_incorrect_end_year": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз (Разница между гродами не должна превышать 7 лет).\n<i>Пример: 2028</i>",
    "registration_incorrect_phone_number": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: +79876543210</i>",
    "registration_incorrect_email": "😔 Кажется, вы ввели некорректные данные.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: ivanovia@std.tyuiu.ru</i>",

    "registration_edit": "Выберите данные для изменения:",
    "registration_edit_full_name": "Введите исправленное ФИО\n<i>Пример: Иванов Иван Иванович</i>",
    "registration_edit_institute": "Выберите исправленный вариант структурного подразделения обучения",
    "registration_edit_direction": "Введите исправленное направление подготовки\n<i>Пример: 09.03.02 Информационные системы и технологии</i>",
    "registration_edit_course": "Введите исправленный номер курса\n<i>Пример: 2</i>",
    "registration_edit_group": "Введите исправленную группу\n<i>Пример: ИИПб-24-2</i>",
    "registration_edit_start_year": "Введите исправленный год начала обучения \n<i>Пример: 2024</i>",
    "registration_edit_end_year": "Введите исправленный год окончания обучения\n<i>Пример: 2028</i>",
    "registration_edit_phone_number": "Введите исправленный номер телефона\n<i>Пример: +79876543210</i>",
    "registration_edit_email": "Введите исправленный адрес электронной почты\n<i>Пример: ivanovia@std.tyuiu.ru</i>",

    "application_select_event_topic": "Выберите направление внеучебной деятельности, по которой проходило мероприятие.\nЕсли вы не знаете направление, обратитесь в поддержку по кнопке «❓ Поддержка».",
    "application_fill_event_name": "Введите название мероприятия, в котором вы приняли участие:",
    "application_fill_event_date": "Введите дату проведения мероприятия.\n<i>Например: 21.07.2025</i>",
    "application_fill_event_location": "Введите площадку, на которой проходило мероприятие:",
    "application_event_select_role": "Выберите свою роль на мероприятии:",
    "application_event_material": "Загрузите материал, подтверждающий ваше участие.\nФормат: документ, ссылка, медиафайл, приказ, публикация и другие формы, подтверждающие участие в мероприятии.\n\n 📎 <b>Вы можете приложить до 3 материалов</b>",
    "application_confirmation": "Проверьте корректность введенных вами данных:",
    "application_event_end": "🙌 Заявка находится на рассмотрении у модератора.\n\nСрок рассмотрения и подтверждения заявки — до 6 <u>рабочих дней</u> с момента её подачи.\n\nПо итогам проверки вы получите уведомление о начислении «ТИУкоинов» либо комментарий модератора. ",
    "application_event_completed": "😊Ваша заявка на мероприятие '{event_name}' подтверждена!\nВам начислено {awarded_amount} «ТИУкоинов».",
    "application_event_not_completed": "К сожалению, заявка не подтверждена.\nПричина:",
    "application_incorrect_event_date": "😔 Кажется, вы ввели некорректные данные.\nУбедитесь что с даты проведения мероприятия прошло <u>не больше 1 года</u>.\n\nПожалуйста, сверьтесь с примером и попробуйте еще раз.\n<i>Пример: 21.07.2025</i>",
    "application_event_material_incorrect":"❌ Вы уже добавили максимальное количество материалов (3).\nНажмите '✅ Завершить заполнение заявки' для продолжения.",
    
    "application_edit": "Выберите данные, которые вы хотели бы изменить:",
    "application_edit_topic": "Выберите направление внеучебной деятельности заново:",
    "application_edit_name": "Введите измененное название мероприятия: ",
    "application_edit_date": "Введите измененную дату мероприятия:",
    "application_edit_location": "Введите измененную локацию мероприятия:",
    "application_edit_role": "Выберите роль заново:",
    "application_edit_material": "Загрузите материал, подтверждающий ваше участие, заново.",
    
    "selected": "Вы выбрали:",
    "application_other_answer":"Пожалуйста, следуйте инструкции. Для отмены заполнения заявки введите команду /cancel",
    
    "balance": "Баланс «ТИУкоинов»:",
    "select_item": "Выберите поощрение:",
    "coins_confirm": "Подтверждаете списание {spend_amount} коинов?\nВыберите «Да» или «Нет».",
    "confirm_purchase":"🎉 Поздравляем с успешной покупкой!\n\n"
                        "✅ Ваш подарок: {name_of_item}\n"
                        "💰 Списано: {spend_amount} ТИУкоинов\n"
                        "📅 Дата покупки: {purchase_date}\nПодарок можно получить по адресу: Володарского, 38, кабинет .....Уточнить\n\n"
                        "Спасибо за участие в программе 'ТИУмничка'! 🏆",

    "other_answer" : "Я не знаю такой команды",
    "cancel_no_fsm": "Отменять нечего. Вы в главном меню.",
    "cancel_fsm": "Диалог завершён. Возвращаемся в главное меню.",
    "in_state": "❌ Сначала завершите текущий запрос. Используйте /cancel для отмены",
    
    "support_head":"Выберите категорию вашего вопроса:",
    "support_text":"Опишите вашу проблему или вопрос",
    "feedback_text": "Поделитесь вашими впечатлениями о боте. Что нам улучшить?",
    "support_select_event_topic": "Выберите направление внеучебной деятельности",
    "support_end":"📬 Спасибо за обращение! Мы обязательно вернёмся с ответом.\n\nСрок ответа по вопросам, связанным с работой системы, начислением «ТИУкоинов», корректностью данных и вопросами по направлениям, составляет от 1 до 3 <u>рабочих дней</u>."
}