LEXICON_TEXT = {
    "start_text": "👋 Добро пожаловать в цифровую систему «ТИУмничка».\n\n❗️ Для участия в Конкурсе вам необходимо ввести своё ФИО.\n\n<i>Например: Иванов Иван Иванович</i>",
    "start_agreement_text" : "Спасибо! 💙\n\n"
            "Для участия в конкурсе нематериальной мотивации «ТИУмничка» необходимо принести заполненное согласие на обработку персональных данных по одному из адресов:\n\n"
            "📍 1-й учебный корпус\nул. Володарского, д. 38\n• каб. 233 — Департамент по молодежной политике\n• каб. 226 — Отдел по методике и практике воспитательной работы\n\n"
            "📍 5-й учебный корпус\nул. Володарского, д. 38\n• каб. 101 — Центр молодежных инициатив\n\n"
            "🕘 Режим работы:\nпн–чт с 9:00 до 18:00\nпт с 9:00 до 16:45\n\n"
            "После подтверждения документов вам станет доступна подача заявок на начисление «ТИУкоинов» ✨\n\n"
            "👇 Полный текст согласия — по кнопке ниже.",
    "not_registred": "❌ Вы не зарегистрированы в системе, для регистрации введите /start",
    "start_already_registered": "👋 С возвращением!\n\n"
                               "✅ Вы уже зарегистрированы в системе «ТИУмничка».\n\n"
                               "Для работы с ботом используйте кнопки или команды из меню.\n"
                               "📖 Инструкцию можно посмотреть по команде /help",
    "recall_the_agreement":"Вы уверены, что хотите отозвать согласие на обработку персональных данных?\n\nЭто действие является необратимым и приведет к <b>полному прекращению работы бота.</b> Все ваши данные будут удалены, а доступ к командам и функциям будет закрыт.",

    "re_register_text" : "❗️ Для участия в Конкурсе вам необходимо ввести своё ФИО.\n\n<i>Например: Иванов Иван Иванович</i>",
    "registration_completed": "😎 Поздравляем! Вы успешно прошли регистрацию!\n\nТеперь Вам доступна подача заявок на начисление «ТИУкоинов» в рамках конкурса нематериальной мотивации «ТИУмничка». Желаем успехов и активного участия!",

    "help_text": "🤖 <b>Инструкция по работе с ботом</b>\n\n"
            "<b>📋 Основные функции:</b>\n"
            "• <b>📝 Подать заявку</b> - отправить заявку на получение ТИУкоинов\n"
            "• <b>💎 Мои ТИУкоины</b> - посмотреть свой баланс и историю заявок на получение ТИУкоинов\n"
            "• <b>📖 Каталог поощрений</b> - выбрать поощрение за ТИУкоины\n"
            "• <b>📃 О конкурсе</b> - ознакомиться с положением\n"
            "• <b>❓ Поддержка</b> - получить помощь или задать вопрос\n\n"
            "<b>⚡ Команды бота:</b>\n"
            "• <code>/start</code> - запустить бота\n"
            "• <code>/help</code> - эта инструкция\n"
            "• <code>/getmytgid</code> - узнать свой Telegram ID\n"
            "• <code>/cancel</code> - отменить текущее действие\n"
            "• <code>/support</code> - получить помощь или задать вопрос\n"
            "• <code>/recall_the_agreement</code> - отозвать согласие на обработку персональных данных\n\n"
            "<b>💎 О ТИУкоинах:</b>\n"
            "ТИУкоины начисляются за участие в мероприятиях и проектах различных направлений внеучебной деятельности. Их можно обменять на ценные призы в каталоге поощрений.\n\n"
            "<b>📞 Контакты:</b>\n"
            "По всем вопросам обращайтесь в раздел «❓ Поддержка»",

    "about_contest_choice": "📋 <b>Информация о конкурсе доступна в двух форматах:</b>\n\n🖼️ <b>Карточки</b> - для быстрого ознакомления.\n\n📄<b>Положение конкурса</b> - для детального изучения\n\n👇Выберите подходящий формат.",
    "loading_cards": "⏳ Загружаем карточки...",
    "loading_document": "⏳ Загружаем документ...",

    "my_coins_menu": "<b>Мои ТИУкоины</b>\n\n"
                    "Здесь вы можете посмотреть:\n\n"
                    "💎 <b>Баланс ТИУкоинов</b> — Текущее количество коинов\n\n"
                    "📝 <b>История заявок</b> — Ваши заявки на получение ТИУкоинов\n\n"
                    "👇 Выберите, что вас интересует:",

    "registration_incorrect_full_name": "😔 Кажется, вы ввели некорректные данные.\n\n"
        "<i>Требования к формату:</i>\n"
        "• Слова на русском языке\n"
        "• Каждое слово с заглавной буквы\n"
        "• Между словами один пробел\n"
        "• Если в слове есть дефис — пробелы вокруг него <b>не ставятся</b>\n\n"
        "<i>Примеры корректного ввода:</i>\n"
        "• Иванов Иван Иванович\n"
        "• Петрова-Сидорова Мария Анатольевна\n\n"
        "Пожалуйста, сверьтесь с примерами и попробуйте еще раз.",

    "application_select_event_topic": "❔ Выберите направление, по которому проходило мероприятие.\nЕсли вы не знаете направление, обратитесь в поддержку по команде /support.",
    "application_fill_event_name": "❔ Введите название мероприятия, в котором вы приняли участие:",
    "application_fill_event_date": "❔ Введите дату проведения мероприятия.\n"
        "<i>Например: 21.07.2025</i>\n\n"
        "❗️ Заявки на подтверждение участия в мероприятии подаются не позднее 5-го числа каждого месяца, следующего после проведения мероприятия. Заявки, поданные по истечении указанного срока, могут быть отклонены Модератором мероприятия.",
    "application_fill_event_location": "❔ Введите название площадки, на которой проходило мероприятие.\n\n<i>Примеры площадок:</i>\n• ДК «Нефтяник» \n• Контора Пароходства, г. Тюмень",
    "application_event_select_role": "❔ Выберите свою роль на мероприятии:",
    "application_event_material": "❔ Загрузите материал, подтверждающий ваше участие.\nФормат: документ, ссылка, медиафайл, приказ, публикация и другие формы, подтверждающие участие в мероприятии.\n\n 📎 <b>Вы можете приложить до 3 материалов</b>",
    "application_confirmation": "❕ Внимательно проверьте корректность введенных вами данных:",
    "application_event_end": "🙌 Заявка находится на рассмотрении у модератора.\n\nСрок рассмотрения и подтверждения заявки — до <u>6 рабочих дней</u> с момента её подачи.\n\nПо итогам проверки вы получите уведомление о начислении ТИУкоинов либо комментарий модератора. ",
    "application_incorrect_event_date": "😔 Кажется, вы ввели некорректные данные.\n\n"
        "❗️ Заявки на подтверждение участия в мероприятии подаются не позднее 5-го числа каждого месяца, следующего после проведения мероприятия. Заявки, поданные по истечении указанного срока, могут быть отклонены Модератором мероприятия.\n\n"
        "<i>Требования к формату:</i>\n"
        "• Формат: ДД.ММ.ГГГГ\n\n"
        "<i>Примеры корректного ввода:</i>\n"
        "• 21.07.2025\n"
        "• 26.01.2026\n\n"
        "Пожалуйста, сверьтесь с примерами и попробуйте еще раз.\n",
    "application_event_material_incorrect": "❌ Вы уже добавили максимальное количество материалов (3/3).\nНажмите «✅ Завершить заполнение заявки» для продолжения. После завершения вы сможете отредактировать загруженные материалы",
    
    "application_edit": "❔ Выберите данные, которые вы хотели бы изменить:",
    "application_edit_topic": "❔ Выберите направление внеучебной деятельности заново:",
    "application_edit_name": "❔ Введите исправленное название мероприятия: ",
    "application_edit_date": "❔ Введите исправленную дату проведения мероприятия:",
    "application_edit_location": "❔ Введите исправленное название площадки проведения мероприятия:",
    "application_edit_role": "❔ Выберите роль заново:",
    "application_edit_material": "❔ Загрузите материал, подтверждающий ваше участие, заново.",
    
    "selected": "Вы выбрали:",
    "application_other_answer": "Пожалуйста, следуйте инструкции. Для отмены заполнения заявки введите команду /cancel",

    "other_answer" : "😐 Я не знаю такой команды.",
    "cancel_no_fsm": "Отменять нечего. Вы в главном меню.",
    "cancel_fsm": "Диалог завершён. Возвращаемся в главное меню.",
    "in_state": "❌ Сначала завершите текущий запрос. Используйте /cancel для отмены.",
    
    "support_head": "Выберите тип обращения:",
    "support_text": "Опишите вашу проблему или вопрос.",
    "feedback_text": "Поделитесь вашими впечатлениями о боте. Что нам улучшить?",
    "support_select_event_topic": "Выберите направление внеучебной деятельности:",
    "support_end": "📬 Спасибо за обращение! Мы обязательно вернёмся с ответом.\n\nСрок ответа по вопросам, связанным с работой системы, начислением ТИУкоинов, корректностью данных и вопросами по направлениям, составляет <u>от 1 до 3 рабочих</u> дней.",

    "invalid_coefficient": "❌ Некорректный коэффициент повторяемости\n\nПожалуйста, введите корректное значение коэффициента в диапазоне от 4 до 6.",
    "recall": "⏳ Начинаю процесс удаления..."
}